[
{
  "text": "Another uncomfortable thought:\nIf work is your entire personality, then you’re not living - you’re being utilised.\nSome people don’t experience time.\n\nThey consume it in slots.\nEven rest is ‘well-deserved’.\nEven joy needs justification.\n\nThey don’t sit with thoughts.\nThey schedule them.\n\nThe tragedy isn’t working hard.\nThe tragedy is outsourcing meaning to a payslip.\n\nPhilosophers warned us about this long ago -\nwhen identity collapses into function, humans become tools that applaud their own usefulness.\n\nTitles feel permanent until they aren’t.\nCalendars feel important until they stop filling themselves.\n\nAnd when work finally goes quiet - layoffs, burnout, weekends, retirement -\nthere’s a strange silence no KPI prepares you for.\n\nBecause if you only know how to be productive,\nyou don’t know how to be present.\n\nWork should sharpen you.\nNot replace you.\n\nA life that cannot slow down\nis not ambitious -\nit’s afraid of stillness.",
  "engagement": 99
},

{
  "text": "I sometimes hate how we only post 'happy' moments here and I have always wanted to change it.\n\nSo, I am going to start with myself.\n\nNo, I didn't get a new job, cracked a new company, got 7 figure salaries etc.\n\nI just want to normalize being 'not delighted/excited' all the time.\n\nWe live in a world where everyone is ‘grateful’, ‘honoured’, and ‘thrilled’.\nBut rarely do you see - ‘tired’, ‘lost’, or ‘unsure’.\n\nWe all are humans, and we all feel things - not all days are good.\n\nYou know what’s truly rare on LinkedIn?\nSomeone saying: ‘I don’t have it figured out, but I’m still trying.’\n\nSo, here I am -\n\nI am not doing great, have been fighting - 1 day at a time. I think I will get through it :)\n\nThere's nothing more motivational than being myself for me :)",
  "engagement": 124
},

{
  "text": "Job hunting in India is not for the weak.\n\nYou’ll see a post that says ‘We’re urgently hiring!’\nYou apply in 30 seconds.\nAnd they ghost you faster than your ex.\n\n‘Easy Apply’ feels like Tinder.\nYou swipe, they ignore.\nAnd somewhere, HR writes - ‘We’ll get back to you.’\n\nYou update your resume 47 times, change fonts, remove hobbies, add buzzwords like ‘team player’, ‘growth mindset’, and ‘Excel wizard’…\nStill no reply.\nMeanwhile on LinkedIn:\nPeople with 2 connections and 0 experience write -\n‘I’m thrilled to announce I’ve joined Google.’\nAnd you’re sitting there thinking -\nMaybe I should be ‘thrilled’ to announce that I’m still unemployed.\n\nBut here’s the truth:\nYou’re not lazy.\nYou’re not behind.\nYou’re just living in a country where ‘experience required: 3 years’ comes in intern listings.\nSo hang in there.\n\nBecause one day, you’ll get that offer.\nAnd your ‘We’re happy to have you onboard’ email will feel like a national award.",
  "engagement": 321
},

{
  "text": "We spend half our lives thinking -\n‘Once I get there, I’ll be happy.’\n\nBut there is no ‘there.’\nEvery goal you hit shifts the finish line.\nMaybe the real success is not in arrival,\nbut in learning to love the walk - even when it’s uphill.",
  "engagement": 144
},

{
  "text": "When one airline collapses… the others show their true colours.\nAnd unfortunately, it’s not humanity. It’s pricing strategy.\n\nWith IndiGo flights getting cancelled across sectors, thousands of passengers are stranded, panicking, and scrambling for alternatives.\nAnd what did the other airlines do?\n\nQuietly increase fares.\nNot by ₹500… but by ₹5,000–₹10,000+ in some routes.\n\nLook at Delhi → Mumbai today:\n\nThe same flights that were ₹5k–₹6k last week are suddenly ₹24k–₹25k+.\nNo festival.\nNo surge in fuel cost.\nJust people in trouble - and a perfect opportunity to profit.\n\nI know business is business.\nBut sometimes, basic humanity > revenue targets.\n\nImagine families trying to get home.\nStudents.\nPeople travelling for medical emergencies.\nOr someone who simply cannot afford a last-minute 2x fare overnight.\n\nIn moments like these, industries show what they’re truly made of.\n\nA little empathy won’t kill the quarterly numbers.\nBut it might restore faith in the system.\n\nWe need pricing regulations during crises.\nWe need accountability.\nWe need humanity.\n\nBecause when airlines turn a crisis into a revenue opportunity…\nit’s not ‘dynamic pricing’.\nIt’s just disappointing.",
  "engagement": 667
},

{
  "text": "Presenting my 2025 LinkedIn Wrapped:\n\nMessages I replied to immediately: 2\nMessages I replied to after 7 days with ‘Sorry, missed this’: 143\nMessages I saw, ignored, and still lost sleep over: 89\n\nRecruiters who said ‘Your profile is impressive, let’s connect’: 27\nRecruiters who vanished after I replied: all 27\n\nPeople who endorsed me for skills I don’t even have: 11\nPeople I endorsed out of guilt: 11\n\nWebinars I registered for: 52\nWebinars I actually attended: 0\nWebinars I left running just for the certificate: 8\n\nTimes I opened LinkedIn for motivation: 34\nTimes I left LinkedIn feeling useless: 34\n\nPosts I wrote from the heart: 7\nPosts that went viral: 0\nPosts I wrote in anger at 2 AM that surprisingly went viral: 1\n\nPeople who said ‘Let’s grab coffee sometime’: 19\nActual coffees grabbed: 0\nTimes I grabbed coffee alone while thinking about my life: 47\n\nTimes I said ‘Let’s connect offline’: 13\nTimes I meant it: … let’s skip this one.\n\nMeetings that could’ve been an email: 96\nEmails that could’ve been nothing: 41\n‘Quick sync?’ messages that ruined my entire day: 57\n\nLinkedIn Wrapped 2025 taught me only one thing:\nWe’re all pretending to have our life together,\nand honestly… we deserve an award for acting.",
  "engagement": 123
},
{    
  "text": "I don't know why people hate Gen Z so much.\n\nWe are so honest.\n\nAap likhte hoge ki chutti chahiye - beemar hu and all.\n\nWe speak the truth.\n\nChutti chahiye.\n\nManager asks 'Kyu?'\n\nWe say -\n\nBreak up ho gaya.\nVibe nahi ho paa raha hai.\nI am tired.\nMental break chahiye.\nShopping jaana hai.\npichle week zyada kaam kar liya tha.\n\nThe people who are the most jealous of this - Boomers.\n\nThey're like - Haww, aisa kaisa?\n\n'Jabb mere chacha ji ki death Hui thi, uss dinn bhi maina kaam kiya tha'\n\n'Mere shaadi Wale dinn, subha bhi I worked - raat ko hi thi na shaadi'\n\nBruh.\nThis is not a thing to show off.\n\nTake breaks please, nothing increases productivity more than this.\n\nSometimes just wonder and sit - Main kaam karr kyu raha hu? Taakki I can enjoy life.\n\n- I can attend my best friend's wedding.\n- I can roam the world.\n- I can afford things for the people I love.\n\nPleaseeeee don't make WORK your entire personality.\n\nAt least I don't need to revive my dada, dadi, chacha, chachi etc for each job - taakki I can get a leave.",
  "engagement": 112
},
{
  "text": "When ‘business continuity’ becomes more important than human empathy.\nSomeone lost a loved one.\n\nThey informed the HR team.\nAnd this was the response.\n\n‘We completely understand and empathize with your situation.\nHowever, due to operational needs, we will not be able to postpone your start date beyond Monday, October 27, 2025.’\n\nA line that says ‘we empathize’\nfollowed by a paragraph that proves they don’t.\n\nImagine losing someone close to you…\nAnd instead of time, space, or support -\nYou get a corporate deadline.\nThis is not just about one company.\n\nIt’s about a culture that has started prioritizing ‘business continuity’ over human continuity.\n\nWe talk about empathy in leadership, compassion in workplaces, and mental health awareness -\nBut when it truly matters, this is how we show up.\n\nHere’s the truth:\nIf a company cannot accommodate a few days of grief, it’s not a workplace — it’s a machine.\n\nGrief doesn’t follow HR policy.\nPeople are not replaceable just because ‘operations can’t wait.’\n\nIt’s time we stop measuring productivity in hours -\nand start measuring humanity in actions.",
  "engagement": 110
},
{
  "text": "This icon hurts more than surge pricing.\n\nEvery time I book a ride, I see this man…\nHis hand raised, his face turned away -\nas if saying, ‘Chee, mere munh matt lago.’\n\nAnd honestly, it’s not even the rejection that stings.\nIt’s how the app shows it to you.\nThat sad little cartoon - mocking your middle-class hope of getting a ride without paying extra ₹30.\n\nApps have learned the art of emotional manipulation.\nEven a ‘Try adding more’ is now wrapped in guilt and shame.\nYou don’t just feel rejected - you feel cheap.\n\nSomewhere between ‘Finding nearby captains…’ and\n‘Captains aren’t accepting your fare,’\nwe lost the joy of convenience -\nand got stuck negotiating with algorithms.\n\nDesign isn’t just about UX -\nit’s about emotion engineering.\nAnd this one?\nIt hits where it hurts most - our dignity at ₹40. 💔\n\nSometimes, empathy in design isn’t about what you say —\nit’s about how you show rejection.\nRapido",
  "engagement": 103
},
{
  "text": "Dear Indians,\nYour life officially has ₹0 value.\n\nHere’s what happened 👇\nFSSAI banned ORSL because it contained high sugar and didn’t comply with the WHO-recommended formula - meaning it was unsafe for health.\n\nThe company requested:\n\n> ‘Please sir, we have ₹180 crore worth of stock.\nPlease let us sell it.’\n\nAnd the court said,\n\n> ‘Okay, sell it.’\n\nSo now, ₹180 crore worth of product got priority over the health of 140 crore Indians.\n\nThis is not about one company.\nIt’s about a system where:\n\nCompliance bends when money talks\n\nHealth becomes negotiable\n\nPeople become replaceable\n\nWhen a product that fails global health standards is allowed on shelves just because it’s ‘already produced,’ what message are we sending?\n\nThat profit > public health?\nThat inventory > integrity?\n\nAs someone who works in the corporate world - I understand business pressures, I understand losses.\nBut there’s a line between protecting your balance sheet and compromising an entire nation’s health.\n\nWe talk about ‘Building for Bharat.’\nMaybe it’s time we also talk about Protecting Bharat.\n\nBecause when ₹180 crore matters more than 140 crore people,\nit’s not just a policy failure - it’s a moral collapse.",
  "engagement": 90
},
{
  "text": "Toxic managers don’t burn out teams. They drain souls.\n\nThey say people don’t leave companies -\nthey leave managers.\n\nBut here’s the thing -\nsome people don’t even get the chance to leave.\n\nBecause by the time they realize how toxic the environment is,\nthey’ve already lost their confidence,\ntheir energy,\nand sometimes… their entire sense of self-worth.\n\nYou’ll hear things like:\n‘You need to toughen up.’\n‘This is how corporate works.’\n‘Everyone’s replaceable.’\n\nAnd somehow - that becomes normal.\n\nBut if you make people work out of fear,\nyou might hit your targets,\nbut you’ll lose your team.\n\nA good manager creates results.\nA great one creates peace.",
  "engagement": 392
}

]
